OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Audio_Headset/USB/descriptors_10.c
/******************************************************************************
 * @file     descriptors.c
 * @brief    NuMicro series USBD driver source file
 * @date     2017/04/26 09:30 a.m.
 *
 * @note
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
/*!<Includes */
#include "NUC505Series.h"
#include "AudioLib.h"
#include "usbd_audio_10.h"

/*
  *Microphone - Interface alternate 1~6
  +-----------+------------+----------------+------------------+
  | Alternate | Channel(s) | Bit Resolution | Sampling Rate(s) |
  +-----------+------------+----------------+------------------+
  |     1     |      1     |     16 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     2     |      1     |     16 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+
  |     3     |      2     |     16 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     4     |      2     |     24 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     5     |      2     |     16 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+
  |     6     |      2     |     24 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+

  *Speaker - Interface alternate 1~4
  +-----------+------------+----------------+------------------+
  | Alternate | Channel(s) | Bit Resolution | Sampling Rate(s) |
  +-----------+------------+----------------+------------------+
  |     1     |      2     |     16 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     2     |      2     |     24 bits    |  44.1kHz, 48kHz  |
  +-----------+------------+----------------+------------------+
  |     3     |      2     |     16 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+
  |     4     |      2     |     24 bits    |      96kHz       |
  +-----------+------------+----------------+------------------+

  Note:
  1.If you want to remove certain alternate for Microphone or Speaker interface, please remove the group of
    the alternate descriptors (Standard AS interface, Audio Streaming Class Specific Interface Descriptor,
    Audio Streaming Format Type Descriptor, Endpoint Descriptor, Audio Streaming Class Specific Audio Data
    Endpoint Descriptor) and modify the Total Length field of Configuration Descriptor.
    For example,
      Remove  Microphone Interface alternate 6 (24 bit resolution) from Speaker & Microphone descriptor with HID

      1.Remove the following descriptors for Microphone - Interface alternate 6
         Microphone - Interface alternate 6
           Standard AS interface                                         (0x09)
           Audio Streaming Class Specific Interface Descriptor           (0x07)
           Audio Streaming Format Type Descriptor                        (0x0B)
           Endpoint Descriptor                                           (0x07)
           Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07)
           *Interface alternate Summary                                  (0x29)

      2.Modify the Total Length field of Configuration Descriptor to 0x20B

         0x234(Original Total Length) - 0x29(Total Length of descriptors for Microphone - Interface alternate 6) = 0x20B

      3.Modify the change for interface alternate in UAC_SetInterface_10.c

  2.If you want to add / remove sampling rate to certain alternate for Microphone or Speaker interface,
    please modify Audio Streaming Format Type Descriptor (bLength, bSamFreqType, tSamFreq fields)
    and the Total Length field of Configuration Descriptor.
    For example,
      Add 48kHz to Speaker Interface alternate 3 (16 bit resolution) from Speaker & Microphone descriptor with HID

      1.Modify Audio Streaming Format Type Descriptor for Speaker Interface alternate 3

         Audio Streaming Format Type Descriptor
         +--------------------+------------------+-------------------+
         | *bLength           |  Original Value  |   Modified Value  |
         +--------------------+------------------+-------------------+
         | bLength            |        0x0B      |   0x0E(+3 Bytes)  |
         +--------------------+------------------+-------------------+
         | bDescriptorType    |        0x24      |        0x24       |
         +--------------------+------------------+-------------------+
         | bDescriptorSubType |        0x02      |        0x02       |
         +--------------------+------------------+-------------------+
         | bFormatType        |        0x01      |        0x01       |
         +--------------------+------------------+-------------------+
         | bNrChannels        |        0x02      |        0x02       |
         +--------------------+------------------+-------------------+
         | bSubFrameSize      |        0x02      |        0x02       |
         +--------------------+------------------+-------------------+
         | bBitResolution     |        0x10      |        0x10       |
         +--------------------+------------------+-------------------+
         | *bSamFreqType      |        0x01      | 0x02(+1 Frequency)|
         +--------------------+------------------+-------------------+
         | *tSamFreq          | PLAY_RATE_96K_LO |  PLAY_RATE_96K_LO |
         |                    | PLAY_RATE_96K_MD |  PLAY_RATE_96K_MD |
         |                    | PLAY_RATE_96K_HI |  PLAY_RATE_96K_HI |
         |                    |                  |  PLAY_RATE_48K_LO |
         |                    |                  |  PLAY_RATE_48K_MD |
         |                    |                  |  PLAY_RATE_48K_HI |
         +--------------------+------------------+-------------------+

      2.Modify the Total Length field of Configuration Descriptor to 0x237.

