OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Audio_Headset/USB/descriptors_10.c
#define HID_REPORT_DESCRIPTOR_SIZE_10   HID_KEYBOARD_REPORT_DESC_SIZE_10

#endif

/*!<USB Configure Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8ConfigDescriptor_10[] =
{
#else
uint8_t gu8ConfigDescriptor_10[] __attribute__((aligned(4))) =
{
#endif
    /* Configuration Descriptor */
    LEN_CONFIG,         /* bLength */
    DESC_CONFIG,        /* bDescriptorType */
#ifdef __BOTH__
#ifdef __HID__
    0x34, 0x02,          /* wTotalLength
                           Descriptor without HID                     (0x21B)
                           HID Descriptor
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)

                           0x21B + 0x09 + 0x09 + 0x07 = 0x234
                        */
    0x04,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone), Interface 2 (Speaker), Interface 3 (HID) */
#else
    0x1B, 0x02,         /* wTotalLength */
    /*
       Configuration Descriptor                    (0x09)
       Interface Descriptor (Audio Class)          (0x09)
       Audio Control Interface Header Descriptor   (0x0A)
       Microphone - Audio Control
         Audio Control Input Terminal Descriptor   (0x0C)
         Audio Control Feature Unit Descriptor     (0x08)
         Audio Control Output Terminal Descriptor  (0x09)
       Speaker - Audio Control
         Audio Control Input Terminal Descriptor   (0x0C)
         Audio Control Feature Unit Descriptor     (0x0A)
         Audio Control Output Terminal Descriptor  (0x09)
       Microphone - Interface alternate 0
         Standard AS interface                     (0x09)
       Microphone - Interface alternate 1~6
         Standard AS interface                                         (0x09,0x09,0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Interface Descriptor           (0x07,0x07,0x07,0x07,0x07,0x07)
         Audio Streaming Format Type Descriptor                        (0x0E,0x0B,0x0E,0x0E,0x0B,0x0B)
         Endpoint Descriptor                                           (0x07,0x07,0x07,0x07,0x07,0x07)
         Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07,0x07,0x07,0x07,0x07,0x07)
         *Each Interface alternate Summary                             (0x2C,0x29,0x2C,0x2C,0x29,0x29)
       Speaker - Interface alternate 0
         Standard AS interface                     (0x09)
       Speaker - Interface alternate 1~4
         Standard AS interface                                         (0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Interface Descriptor           (0x07,0x07,0x07,0x07)
         Audio Streaming Format Type Descriptor                        (0x0E,0x0E,0x0B,0x0B)
         Endpoint Descriptor                                           (0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07,0x07,0x07,0x07)
         *Each Interface alternate Summary                             (0x2E,0x2E,0x2B,0x2B)

       0x09 + 0x09 + 0x0A + (0x0C + 0x08 + 0x09) + (0x0C + 0x0A + 0x09) +
       0x09 + 0x2C + 0x29 + 0x2C + 0x2C + 0x29 + 0x29 +
       0x09 + 0x2E + 0x2E + 0x2B + 0x2B = 0x21B
    */
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone), Interface 2 (Speaker) */
#endif
#elif defined __MIC_ONLY__
#ifdef __HID__
    0x59, 0x01,         /* wTotalLength
                           Descriptor without HID                     (0x140)
                           HID Descriptor
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)

                           0x140 + 0x09 + 0x09 + 0x07 = 0x159
                        */
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone), Interface 2 (HID) */
#else
    0x40, 0x01,         /* wTotalLength */
    /*
       Configuration Descriptor                    (0x09)
       Interface Descriptor (Audio Class)          (0x09)
       Audio Control Interface Header Descriptor   (0x09)
       Microphone - Audio Control
         Audio Control Input Terminal Descriptor   (0x0C)
         Audio Control Feature Unit Descriptor     (0x08)
         Audio Control Output Terminal Descriptor  (0x09)
       Microphone - Interface alternate 0
         Standard AS interface                     (0x09)
       Microphone - Interface alternate 1~6
         Standard AS interface                                         (0x09,0x09,0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Interface Descriptor           (0x07,0x07,0x07,0x07,0x07,0x07)
         Audio Streaming Format Type Descriptor                        (0x0E,0x0B,0x0E,0x0E,0x0B,0x0B)
         Endpoint Descriptor                                           (0x07,0x07,0x07,0x07,0x07,0x07)
         Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07,0x07,0x07,0x07,0x07,0x07)
         *Each Interface alternate Summary                             (0x2C,0x29,0x2C,0x2C,0x29,0x29)

       0x09 + 0x09 + 0x9 + (0x0C + 0x08 + 0x09) +
       0x09 + 0x2C + 0x29 + 0x2C + 0x2C + 0x29 + 0x29 = 0x140
    */
    0x02,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone) */
#endif
#elif defined __SPEAKER_ONLY__
#ifdef __HID__
    0x0E, 0x01,         /* wTotalLength
                           Descriptor without HID                      (0xF5)
                           HID Descriptor
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)

                           0xF5 + 0x09 + 0x09 + 0x07 = 0x10E
                        */
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker), Interface 2 (HID) */
#else
    0xF5, 0x00,         /* wTotalLength */
    /*
       Configuration Descriptor                    (0x09)
       Interface Descriptor (Audio Class)          (0x09)
       Audio Control Interface Header Descriptor   (0x09)
       Speaker - Audio Control
         Audio Control Input Terminal Descriptor   (0x0C)
         Audio Control Feature Unit Descriptor     (0x0A)
         Audio Control Output Terminal Descriptor  (0x09)
       Speaker - Interface alternate 0
         Standard AS interface                     (0x09)
       Speaker - Interface alternate 1~4
         Standard AS interface                                         (0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Interface Descriptor           (0x07,0x07,0x07,0x07)
         Audio Streaming Format Type Descriptor                        (0x0E,0x0E,0x0B,0x0B)
         Endpoint Descriptor                                           (0x09,0x09,0x09,0x09)
         Audio Streaming Class Specific Audio Data Endpoint Descriptor (0x07,0x07,0x07,0x07)
         *Each Interface alternate Summary                             (0x2E,0x2E,0x2B,0x2B)

       0x09 + 0x09 + 0x09 + (0x0C + 0x0A + 0x09) +
       0x09 + 0x2E + 0x2E + 0x2B + 0x2B = 0xF5
    */
    0x02,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker) */
#endif
#endif
    0x01,               /* bConfigurationValue */
    0x00,               /* iConfiguration */
    0x80,               /* bmAttributes */
    0x20,               /* Max power */

    /* Interface Descriptor (Audio Class) */
    0x09,               /* bLength */
    0x04,               /* bDescriptorType */
    0x00,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x00,               /* bNumEndpoints */
    0x01,               /* bInterfaceClass:AUDIO */
    0x01,               /* bInterfaceSubClass:AUDIOCONTROL */
    0x00,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* Audio Control Interface Header Descriptor */
#ifdef __BOTH__
    0x0A,               /* bLength */
#elif defined __MIC_ONLY__  || defined __SPEAKER_ONLY__
    0x09,               /* bLength */
#endif
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x01,               /* bDescriptorSubType:HEADER */
    0x00, 0x01,         /* bcdADC:1.0 */
#ifdef __BOTH__
    0x46, 0x00,         /* wTotalLength
                           Audio Control Interface Header Descriptor  (0x0A)
                           Microphone - Audio Control
                             Audio Control Input Terminal Descriptor  (0x0C)
                             Audio Control Feature Unit Descriptor    (0x08)
                             Audio Control Output Terminal Descriptor (0x09)
                           Speaker - Audio Control
                             Audio Control Input Terminal Descriptor  (0x0C)
                             Audio Control Feature Unit Descriptor    (0x0A)
                             Audio Control Output Terminal Descriptor (0x09)

                             0x0A + (0x0C + 0x08 + 0x09) + (0x0C + 0x0A + 0x09) = 0x46
                        */
    0x02,               /* bInCollection */
    0x01,               /* baInterfaceNr(1) - Microphone */
    0x02,               /* baInterfaceNr(2) - Speaker */
#elif defined __MIC_ONLY__  || defined __SPEAKER_ONLY__
#ifdef __MIC_ONLY__
    0x26, 0x00,         /* wTotalLength
                           Audio Control Interface Header Descriptor   (0x09)
                           Microphone - Audio Control
                             Audio Control Input Terminal Descriptor   (0x0C)
                             Audio Control Feature Unit Descriptor     (0x08)
                             Audio Control Output Terminal Descriptor  (0x09)

